perf/stress_testing/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 200
    - name: Plain
      duration: 60
      arrivalRate: 200
    - name: Ramp down
      duration: 30
      arrivalRate: 200
    - name: Stop
      duration: 30
      arrivalRate: 1
  variables:
    station:
      - 'SAEZ'
      - 'KJFK'
      - 'LIRE'
      - 'RJTY'
    

scenarios:
  - name: Metar (/metar)
    flow:
      - get:
          url: '/metar'
          qs: 
            station: '{{ station }}'