perf/stress_testing/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 40
    - name: Plain
      duration: 60
      arrivalRate: 40
    - name: Ramp down
      duration: 30
      arrivalRate: 40
    - name: Stop
      duration: 30
      arrivalRate: 1
  variables:
    station:
    - 'SAEZ'
    - 'KJFK'
    - 'LIRE'
    - 'RJTY'
    - 'KLAX'
    - 'KNXF'
    - 'KUKI'
    - 'KITR'
    - 'EFHK'
    - 'EFTU'
    - 'EFOU'
    - 'EGBB'
    - 'EGLC'
    - 'EKYT'
    - 'ENGM'
    - 'EPKK'
    - 'EPWA'
    - 'ESMS'
    - 'ESND'
    - 'ESST'
    - 'LCLK'


scenarios:
  - name: Metar (/metar)
    flow:
      - get:
          url: '/metar'
          qs:
            station: '{{ station }}'